{"keras_version": "1.2.0", "class_name": "Model", "config": {"name": "create_dense_net", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 80, 80, 4], "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "initial_conv2D", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "initial_conv2D", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 16, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["initial_conv2D", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_2", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_4", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 16, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "averagepooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_6", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_7", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_7", 0, 0]]]}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_8", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_9", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_9", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_9", 0, 0]]]}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_10", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_10", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 16, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "averagepooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_11", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"name": "convolution2d_11", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_11", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_12", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]]}, {"name": "convolution2d_12", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_12", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_12", 0, 0]]]}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_13", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"name": "convolution2d_13", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_13", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 1, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 32, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 1, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_14", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"name": "convolution2d_14", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_14", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "init": "he_uniform", "trainable": true, "activity_regularizer": null, "bias": false, "nb_filter": 8, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "border_mode": "same", "activation": "linear", "nb_row": 3, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "mode_type": "raw", "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": -1, "arguments": {}, "output_shape": null, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_12", 0, 0], ["convolution2d_14", 0, 0]]]}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_15", "gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "axis": -1, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "elu", "trainable": true}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "globalaveragepooling2d_1", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": 32, "W_regularizer": null, "activation": "linear", "trainable": true}, "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}